In [1]:
import pandas as pd

In [15]:
data1={'id':[1,2,3,4],'gender':['f','f','m','m']}
df1=pd.DataFrame(data1)
df1

   id gender
0   1      f
1   2      f
2   3      m
3   4      m

In [17]:
data2={'id':[1,2,3,4],'age':[28,25,39,10]}
df2=pd.DataFrame(data2)
df2

   id  age
0   1   28
1   2   25
2   3   39
3   4   10

In [18]:
pd.merge(df1,df2,left_on='id',right_on='id')

   id gender  age
0   1      f   28
1   2      f   25
2   3      m   39
3   4      m   10

In [19]:
data3={'id':[1,2,3,5],'job':['n','y','y','n']}
df3=pd.DataFrame(data3)
df3

   id job
0   1   n
1   2   y
2   3   y
3   5   n

In [20]:
pd.merge(df1,df3,left_on='id',right_on='id')#inner join

   id gender job
0   1      f   n
1   2      f   y
2   3      m   y

In [21]:
pd.merge(df1,df3,how='left',left_on='id',right_on='id')#left join

   id gender  job
0   1      f    n
1   2      f    y
2   3      m    y
3   4      m  NaN

In [22]:
pd.merge(df1,df3,how='outer',left_on='id',right_on='id')#outer

   id gender  job
0   1      f    n
1   2      f    y
2   3      m    y
3   4      m  NaN
4   5    NaN    n

In [23]:
data4={'id':[1,2,3,4],'job':['y','y','y','y']}
df4=pd.DataFrame(data4)
df4

   id job
0   1   y
1   2   y
2   3   y
3   4   y

In [26]:
pd.merge(df3,df4,left_on='id',right_on='id',suffixes=('_left','_right'))

   id job_left job_right
0   1        n         y
1   2        y         y
2   3        y         y